[
    {
        "title": "Real Time Chat Application",
        "description": "Description for the real time chat application",
        "src": "/files/pocketbase.svg",
        "alt": "Alternate tag for RTC",
        "primary_color": "#b8dbe4",
        "secondary_color": "#FFFFFF"
    },
    {
        "title": "Media Naranja Speed Dating",
        "description": "Speed dating web application that seamlessly combines React for the dynamic user interface and Supabase for a backend infrastructure. Leveraging Supabase's secure authentication, the application ensures safe access control. Real-time updates keep administrators informed and in control. For participants, the backend utilizes Supabase's database to intelligently match individuals based on gender, creating pairs with unique session tokens. Participants can conveniently scan QR codes to connect with their matched pairs. The entire system is designed with responsiveness in mind, ensuring a seamless experience across various devices.",
        "src": "/files/MNSD.svg",
        "alt": "Alternate tag for MNSD",
        "primary_color": "#f60",
        "secondary_color": "#FFFFFF"
    },
    {
        "title": "Spotify Playlist Widget",
        "description": "This application, built with React in the frontend and Go in the backend, allows users to authenticate with Spotify, view their playlists, and access information about artists, and genres based on their playlists. The backend interacts with both the frontend and the Spotify API, and it includes a SQLite server for storing user sessions.",
        "src": "/files/Spotify_logo_with_text.svg.png",
        "alt": "Alternate tag for SPW",
        "primary_color": "#1DB954",
        "secondary_color": "#FFFFFF"
    },
    {
        "title": "Lucien Bot",
        "description": "Discord bot developed in python that demonstrates a simple addition command that can add two numbers or concatenate two strings together, whether they are provided as digits or strings. This showcases how the bot can perform basic calculations. The bot uses the discord.ext.commands framework to handle user-defined commands easily.",
        "src": "/files/discord.png",
        "alt": "Alternate tag for LB",
        "primary_color": "#7289DA",
        "secondary_color": "#FFFFFF"
    }
]